Revit 2027 API
ElectricalPhaseConfiguration Enumeration
An enumerated type to specify the electrical phase configuration.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ElectricalPhaseConfiguration
Public Enumeration ElectricalPhaseConfiguration
public enum class ElectricalPhaseConfiguration
type ElectricalPhaseConfiguration
Members
Member name | Value | Description
Delta | 2 | Electrical phase configuration is delta.
Undefined | 0 | Electrical phase configuration is undefined.
Wye | 1 | Electrical phase configuration is Y.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace